Wiznet-OpenHardware/WizFi250_SDK/WICED-SDK-2.4.0/Wiced/Platform/common/ARM_Cortex_M3/STM32F2xx/stm32f2xx_platform(백업).c
// 2013.12.18 sskim
void dma_polling_thread_hndlr( uint32_t arg );
void spi_dma_thread_hndlr( uint32_t arg );

// 2014.01.07 sskim
#ifdef BUILD_WIZFI250 	// 2014.01.07 sskim
void init_spi_dma_buffer(SPI_DMA_BUFFER *q);
void push_dma_data(SPI_DMA_BUFFER *q, uint32_t buf_len);
int pop_dma_data(SPI_DMA_BUFFER *q, uint8_t *buf, uint32_t *len);
#endif
////////////////////////////////////////////////////////

/******************************************************
 *               Variables Definitions
 ******************************************************/

/* These come from the linker script */
extern void* dct1_start_addr_loc;
extern void* dct1_size_loc;
extern void* dct2_start_addr_loc;
extern void* dct2_size_loc;
extern void* app_hdr_start_addr_loc;
extern void* sram_start_addr_loc;
extern void* sram_size_loc;

static uart_interface_t uart_interfaces[NUMBER_OF_UART_INTERFACES];

static const uint32_t spi_transfer_complete_flags[]=
{
    /* for every stream get a transfer complete flag */
    [0] =  DMA_FLAG_TCIF0,
    [1] =  DMA_FLAG_TCIF1,
    [2] =  DMA_FLAG_TCIF2,
    [3] =  DMA_FLAG_TCIF3,
    [4] =  DMA_FLAG_TCIF4,
    [5] =  DMA_FLAG_TCIF5,
    [6] =  DMA_FLAG_TCIF6,
    [7] =  DMA_FLAG_TCIF7,
};

static const spi_baudrate_division_mapping_t spi_baudrate_prescalers[MAX_NUM_SPI_PRESCALERS] =
{
    { 2,   SPI_BaudRatePrescaler_2   },
    { 4,   SPI_BaudRatePrescaler_4   },
    { 8,   SPI_BaudRatePrescaler_8   },
    { 16,  SPI_BaudRatePrescaler_16  },
    { 32,  SPI_BaudRatePrescaler_32  },
    { 64,  SPI_BaudRatePrescaler_64  },
    { 128, SPI_BaudRatePrescaler_128 },
    { 256, SPI_BaudRatePrescaler_256 },
};

static char stm32_platform_inited = 0;

#ifndef WICED_DISABLE_STDIO
static const wiced_uart_config_t stdio_uart_config =
{
    .baud_rate    = 115200,
    .data_width   = DATA_WIDTH_8BIT,
    .parity       = NO_PARITY,
    .stop_bits    = STOP_BITS_1,
    .flow_control = FLOW_CONTROL_DISABLED,
};

#ifdef BUILD_WIZFI250 //MikeJ 130418 ID1007 - USART Rx sync problem
static wiced_ring_buffer_t stdio_rx_buffer;
static wiced_ring_buffer_t stdio_tx_buffer;
static uint8_t             stdio_rx_data[STDIO_RX_BUFFER_SIZE];
static uint8_t             stdio_tx_data[STDIO_TX_BUFFER_SIZE];
#else
static volatile wiced_ring_buffer_t stdio_rx_buffer;
static volatile uint8_t             stdio_rx_data[STDIO_BUFFER_SIZE];
#endif
static host_semaphore_type_t        stdio_rx_mutex;
static host_semaphore_type_t        stdio_tx_mutex;
#endif /* #ifndef WICED_DISABLE_STDIO */

// sekim 20131125 Add SPI Interface
#ifdef BUILD_WIZFI250
#define SPI_GPIO_CLEAR_COUNT	2
#define CTRL_REQ	2
#define CTRL_RDY	1
#define CTRL_NON	0

//static uint8_t spi_stdio = DISABLE;
static  int8_t spi_tx_sig_cnt = 0;
static uint8_t spi_tx_suspend  = CTRL_NON;
static uint8_t spi_rx_suspend  = CTRL_NON;
static uint8_t spi_rx_previous = CTRL_NON;
static wiced_bool_t spi_rx_stop = WICED_FALSE;

uint8_t platfrom_spi_stdio = 0; // g_wxProfile.spi_stdio, // 0:Auto, 1:RX(UART)TX(UART) 2:RX(SPI)TX(SPI)
uint8_t platfrom_spi_stdio_x = 0;

extern uint8_t g_spix_bulkmode;

#endif


static volatile uint8_t uart_break;

static DMA_InitTypeDef  i2c_dma_init; /* Should investigate why this is global */

static wiced_spi_device_t* current_spi_device = NULL;

//#ifdef RTC_ENABLED
wiced_rtc_time_t wiced_default_time =
{
     /* set it to 12:20:30 08/04/2013 monday */
     .sec   = 30,
     .min   = 20,
     .hr    = 12,
     .weekday  = 1,
     .date  = 8,
     .month = 4,
     .year  = 13
};
//#endif /* #ifdef RTC_ENABLED */

static const uint16_t adc_sampling_cycle[] =
{
    [ADC_SampleTime_3Cycles  ] = 3,
    [ADC_SampleTime_15Cycles ] = 15,
    [ADC_SampleTime_28Cycles ] = 28,
    [ADC_SampleTime_56Cycles ] = 56,
    [ADC_SampleTime_84Cycles ] = 84,
    [ADC_SampleTime_112Cycles] = 112,
    [ADC_SampleTime_144Cycles] = 144,
    [ADC_SampleTime_480Cycles] = 480,
};

#ifndef WICED_DISABLE_MCU_POWERSAVE
static wiced_bool_t wake_up_interrupt_triggered  = WICED_FALSE;
static unsigned long rtc_timeout_start_time           = 0;
#endif /* #ifndef WICED_DISABLE_MCU_POWERSAVE */

#ifdef BUILD_WIZFI250	// 2013.12.20 sskim sekim XXXXXX
host_semaphore_type_t	dma_mutex;
#endif

/******************************************************
 *               Function Definitions
 ******************************************************/

/* STM32F2 common clock initialisation function
 * This brings up enough clocks to allow the processor to run quickly while initialising memory.
 * Other platform specific clock init can be done in init_platform() or init_architecture()
 */
WEAK void init_clocks( void )
{
    //RCC_DeInit( ); /* if not commented then the LSE PA8 output will be disabled and never comes up again */

    /* Configure Clocks */

    RCC_HSEConfig( HSE_SOURCE );
    RCC_WaitForHSEStartUp( );

    RCC_HCLKConfig( AHB_CLOCK_DIVIDER );
    RCC_PCLK2Config( APB2_CLOCK_DIVIDER );
    RCC_PCLK1Config( APB1_CLOCK_DIVIDER );

    /* Enable the PLL */
    FLASH_SetLatency( INT_FLASH_WAIT_STATE );
    FLASH_PrefetchBufferCmd( ENABLE );

    /* Use the clock configuration utility from ST to calculate these values
     * http://www.st.com/st-web-ui/static/active/en/st_prod_software_internet/resource/technical/software/utility/stsw-stm32090.zip
     */
    RCC_PLLConfig( PLL_SOURCE, PLL_M_CONSTANT, PLL_N_CONSTANT, PLL_P_CONSTANT, PPL_Q_CONSTANT ); /* NOTE: The CPU Clock Frequency is independently defined in <WICED-SDK>/Wiced/Platform/<platform>/<platform>.mk */
    RCC_PLLCmd( ENABLE );

    while ( RCC_GetFlagStatus( RCC_FLAG_PLLRDY ) == RESET )
    {
    }
    RCC_SYSCLKConfig( SYSTEM_CLOCK_SOURCE );

    while ( RCC_GetSYSCLKSource( ) != 0x08 )
    {
    }

    /* Configure HCLK clock as SysTick clock source. */
    SysTick_CLKSourceConfig( SYSTICK_CLOCK_SOURCE );

#ifndef WICED_DISABLE_STDIO
    {
		USART_ClockInitTypeDef usart_clock_init_structure;
		STDIO_CLOCK_CMD( STDIO_PERIPH_CLOCK, ENABLE );

		usart_clock_init_structure.USART_Clock   = USART_Clock_Disable;
		usart_clock_init_structure.USART_CPOL    = USART_CPOL_Low;
		usart_clock_init_structure.USART_CPHA    = USART_CPHA_2Edge;
		usart_clock_init_structure.USART_LastBit = USART_LastBit_Disable;

		USART_ClockInit( STDIO_USART, &usart_clock_init_structure );
    }
#endif /* ifdef WICED_DISABLE_STDIO */
}

WEAK void init_memory( void )
{

