Wiznet-OpenHardware/WizFi250_SDK/WICED-SDK-2.4.0/Wiced/Platform/common/ARM_Cortex_M3/STM32F2xx/stm32f2xx_platform(백업).c
}

void init_architecture( void )
{
    uint8_t i;

#ifdef INTERRUPT_VECTORS_IN_RAM
    SCB->VTOR = 0x20000000; /* Change the vector table to point to start of SRAM */
#endif /* ifdef INTERRUPT_VECTORS_IN_RAM */

    if ( stm32_platform_inited == 1 )
        return;

    watchdog_init( );

    /* Initialise the interrupt priorities to a priority lower than 0 so that the BASEPRI register can mask them */
    for ( i = 0; i < 81; i++ )
    {
        NVIC ->IP[i] = 0xff;
    }

    NVIC_PriorityGroupConfig( NVIC_PriorityGroup_4 );

#ifndef WICED_DISABLE_STDIO
    host_rtos_init_semaphore( &stdio_tx_mutex );
    host_rtos_set_semaphore ( &stdio_tx_mutex, WICED_FALSE );
    host_rtos_init_semaphore( &stdio_rx_mutex );
    host_rtos_set_semaphore ( &stdio_rx_mutex, WICED_FALSE );
#ifndef BUILD_WIZFI250 //MikeJ 130528 ID1072 - Improve UART Performance
    ring_buffer_init  ( (wiced_ring_buffer_t*)&stdio_rx_buffer, (uint8_t*)stdio_rx_data, STDIO_BUFFER_SIZE );
    platform_uart_init( STDIO_UART, &stdio_uart_config, (wiced_ring_buffer_t*)&stdio_rx_buffer );
#else
    ring_buffer_init  ( (wiced_ring_buffer_t*)&stdio_rx_buffer, (uint8_t*)stdio_rx_data, STDIO_RX_BUFFER_SIZE );
	ring_buffer_init  ( (wiced_ring_buffer_t*)&stdio_tx_buffer, (uint8_t*)stdio_tx_data, STDIO_TX_BUFFER_SIZE );
    platform_uart_init( STDIO_UART, &stdio_uart_config, (wiced_ring_buffer_t*)&stdio_rx_buffer );
#endif
#endif

#ifdef BUILD_WIZFI250		// 2013.12.20 sskim // sekim XXXXXX
	host_rtos_init_semaphore(&dma_mutex);
#endif

    /* Ensure 802.11 device is in reset. */
    host_platform_init( );

    MCU_RTC_INIT();

    /* Disable MCU powersave at start-up. Application must explicitly enable MCU powersave if desired */
    MCU_CLOCKS_NEEDED();

    stm32_platform_inited = 1;
}

static wiced_result_t wiced_spi_configure_baudrate( uint32_t speed, uint16_t* prescaler )
{
    uint8_t i;

    wiced_assert("Bad args", prescaler != NULL);

    for( i = 0 ; i < MAX_NUM_SPI_PRESCALERS ; i++ )
    {
        if( ( 60000000 / spi_baudrate_prescalers[i].factor ) <= speed )
        {
            *prescaler = spi_baudrate_prescalers[i].prescaler_value;
            return WICED_SUCCESS;
        }
    }

    return WICED_ERROR;
}

static wiced_result_t spi_dma_transfer( const wiced_spi_device_t* spi )
{
    uint32_t loop_count;

    /* Enable dma channels that have just been configured */
    DMA_Cmd(spi_mapping[spi->port].rx_dma_stream, ENABLE);
    DMA_Cmd(spi_mapping[spi->port].tx_dma_stream, ENABLE);

    /* Wait for DMA to complete */
    /* TODO: This should wait on a semaphore that is triggered from an IRQ */
    loop_count = 0;
    while ( ( DMA_GetFlagStatus( spi_mapping[spi->port].rx_dma_stream, spi_transfer_complete_flags[ spi_mapping[spi->port].rx_dma_stream_number ] ) == RESET ) )
    {
        loop_count++;
        /* Check if we've run out of time */
        if ( loop_count >= (uint32_t) SPI_DMA_TIMEOUT_LOOPS )
        {
            wiced_gpio_output_high(spi->chip_select);
            return WICED_TIMEOUT;
        }
    }

    wiced_gpio_output_high(spi->chip_select);
    return WICED_SUCCESS;
}

static void spi_dma_config( const wiced_spi_device_t* spi, wiced_spi_message_segment_t* message )
{
    DMA_InitTypeDef dma_init;
    uint8_t         dummy = 0xFF;

    wiced_assert("Bad args", (spi != NULL) && (message != NULL))

    /* Setup DMA for SPI TX if it is enabled */
    DMA_DeInit( spi_mapping[spi->port].tx_dma_stream );

    /* Setup DMA stream for TX */
    dma_init.DMA_Channel            = spi_mapping[spi->port].tx_dma_channel;
    dma_init.DMA_PeripheralBaseAddr = ( uint32_t )&spi_mapping[spi->port].spi_regs->DR;
    dma_init.DMA_DIR                = DMA_DIR_MemoryToPeripheral;
    dma_init.DMA_PeripheralInc      = DMA_PeripheralInc_Disable;
    dma_init.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;
    dma_init.DMA_BufferSize         = message->length;
    dma_init.DMA_MemoryDataSize     = DMA_MemoryDataSize_Byte;
    dma_init.DMA_Mode               = DMA_Mode_Normal;
    dma_init.DMA_Priority           = DMA_Priority_VeryHigh;
    dma_init.DMA_FIFOMode           = DMA_FIFOMode_Disable;
    dma_init.DMA_FIFOThreshold      = DMA_FIFOThreshold_Full;
    dma_init.DMA_MemoryBurst        = DMA_MemoryBurst_Single;
    dma_init.DMA_PeripheralBurst    = DMA_PeripheralBurst_Single;

    if ( message->tx_buffer != NULL )
    {
       dma_init.DMA_Memory0BaseAddr = ( uint32_t )message->tx_buffer;
       dma_init.DMA_MemoryInc       = DMA_MemoryInc_Enable;
    }
    else
    {
       dma_init.DMA_Memory0BaseAddr = ( uint32_t )(&dummy);
       dma_init.DMA_MemoryInc       = DMA_MemoryInc_Disable;
    }

    DMA_Init( spi_mapping[spi->port].tx_dma_stream, &dma_init );

    /* Activate SPI DMA mode for transmission */
    SPI_I2S_DMACmd( spi_mapping[spi->port].spi_regs, SPI_I2S_DMAReq_Tx, ENABLE );

    /* TODO: Init TX DMA finished semaphore  */

    /* Setup DMA for SPI RX stream */
    DMA_DeInit( spi_mapping[spi->port].rx_dma_stream );
    dma_init.DMA_Channel            = spi_mapping[spi->port].rx_dma_channel;
    dma_init.DMA_PeripheralBaseAddr = ( uint32_t )&spi_mapping[spi->port].spi_regs->DR;
    dma_init.DMA_DIR                = DMA_DIR_PeripheralToMemory;
    dma_init.DMA_PeripheralInc      = DMA_PeripheralInc_Disable;
    dma_init.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;
    dma_init.DMA_BufferSize         = message->length;
    dma_init.DMA_MemoryDataSize     = DMA_MemoryDataSize_Byte;
    dma_init.DMA_Mode               = DMA_Mode_Normal;
    dma_init.DMA_Priority           = DMA_Priority_VeryHigh;
    dma_init.DMA_FIFOMode           = DMA_FIFOMode_Disable;
    dma_init.DMA_FIFOThreshold      = DMA_FIFOThreshold_Full;
    dma_init.DMA_MemoryBurst        = DMA_MemoryBurst_Single;
    dma_init.DMA_PeripheralBurst    = DMA_PeripheralBurst_Single;
    if ( message->rx_buffer != NULL )
    {
        dma_init.DMA_Memory0BaseAddr = (uint32_t)message->rx_buffer;
        dma_init.DMA_MemoryInc = DMA_MemoryInc_Enable;
    }
    else
    {
        dma_init.DMA_Memory0BaseAddr = (uint32_t)&dummy;
        dma_init.DMA_MemoryInc = DMA_MemoryInc_Disable;
    }

