Wiznet-OpenHardware/WizFi250_SDK/WICED-SDK-2.4.0/Wiced/Platform/common/ARM_Cortex_M3/STM32F2xx/stm32f2xx_platform(백업).c
    /* Init and activate RX DMA channel */
    DMA_Init( spi_mapping[spi->port].rx_dma_stream, &dma_init );
    SPI_I2S_DMACmd( spi_mapping[spi->port].spi_regs, SPI_I2S_DMAReq_Rx, ENABLE );

    /* TODO: Init RX DMA finish semaphore */
}

/////////////////////////////////////////////////////////////////
// sekim XXXXXXXXXX
#ifdef BUILD_WIZFI250 	// 2014.01.06 sskim
void init_spi_dma_buffer(SPI_DMA_BUFFER *q)
{
	q->push = 0;
	q->pop = 0;
	q->len = 0;
	q->overflow = 0;
	q->underflow = 0;

	memset(q->buf, 0, sizeof(q->buf));
	memset(q->buf_len, 0, sizeof(q->buf_len));
}

void push_dma_data(SPI_DMA_BUFFER *q, uint32_t buf_len)
{
	if(q->len >= DMA_BUFFER_SIZE)
	{
		q->overflow++;
		q->pop++;
		q->pop = q->pop % DMA_BUFFER_SIZE;
	}
	else
		q->len++;

	q->buf_len[q->push] = buf_len;
	q->push++;
	q->push = q->push % DMA_BUFFER_SIZE;
}

int pop_dma_data(SPI_DMA_BUFFER *q, uint8_t *buf, uint32_t *len)
{
	if(q->len <= 0)
	{
		q->underflow++;
		return -1;
	}

	*len = q->buf_len[q->pop];
	memcpy(buf, q->buf[q->pop], q->buf_len[q->pop]);

	q->pop++;
	q->pop = q->pop % DMA_BUFFER_SIZE;
	q->len--;
	return 0;
}

SPI_DMA_BUFFER spi_rx_dma_buffer;
#endif		// 2014.01.06 sskim
/////////////////////////////////////////////////////////////////

wiced_result_t wiced_spi_init( const wiced_spi_device_t* spi )
{
    GPIO_InitTypeDef gpio_init_structure;
    wiced_result_t   result;
    SPI_InitTypeDef  spi_init;

    wiced_assert("Bad args", spi != NULL);

    MCU_CLOCKS_NEEDED();

#ifndef BUILD_WIZFI250 // sekim 20131125 Add SPI Interface
    /* Init SPI GPIOs */
    gpio_init_structure.GPIO_Mode  = GPIO_Mode_AF;
    gpio_init_structure.GPIO_OType = GPIO_OType_PP;
    gpio_init_structure.GPIO_Speed = GPIO_Speed_100MHz;
    gpio_init_structure.GPIO_Pin   = ((uint32_t) (1 << spi_mapping[spi->port].pin_clock->number)) |
                                     ((uint32_t) (1 << spi_mapping[spi->port].pin_miso->number )) |
                                     ((uint32_t) (1 << spi_mapping[spi->port].pin_mosi->number ));
    GPIO_Init( spi_mapping[spi->port].pin_clock->bank, &gpio_init_structure );

    /* Init the chip select GPIO */
    wiced_gpio_init(spi->chip_select, OUTPUT_PUSH_PULL);
    wiced_gpio_output_high(spi->chip_select);

    GPIO_PinAFConfig( spi_mapping[spi->port].pin_clock->bank, spi_mapping[spi->port].pin_clock->number,  spi_mapping[spi->port].gpio_af );
    GPIO_PinAFConfig( spi_mapping[spi->port].pin_miso->bank,  spi_mapping[spi->port].pin_miso->number,   spi_mapping[spi->port].gpio_af );
    GPIO_PinAFConfig( spi_mapping[spi->port].pin_mosi->bank,  spi_mapping[spi->port].pin_mosi->number,   spi_mapping[spi->port].gpio_af );
#else
    gpio_init_structure.GPIO_Mode  = GPIO_Mode_AF;
    gpio_init_structure.GPIO_OType = GPIO_OType_PP;
	gpio_init_structure.GPIO_PuPd  = GPIO_PuPd_NOPULL;
    gpio_init_structure.GPIO_Speed = GPIO_Speed_100MHz;
    gpio_init_structure.GPIO_Pin   = ((uint32_t) (1 << spi_mapping[spi->port].pin_clock->number)) |
                                     ((uint32_t) (1 << spi_mapping[spi->port].pin_miso->number )) |
                                     ((uint32_t) (1 << spi_mapping[spi->port].pin_mosi->number )) |
                                     ((uint32_t) (1 << gpio_mapping[spi->chip_select].number  ));
    GPIO_Init( spi_mapping[spi->port].pin_clock->bank, &gpio_init_structure );

    GPIO_PinAFConfig( spi_mapping[spi->port].pin_clock->bank, spi_mapping[spi->port].pin_clock->number,  spi_mapping[spi->port].gpio_af );
    GPIO_PinAFConfig( spi_mapping[spi->port].pin_miso->bank,  spi_mapping[spi->port].pin_miso->number,   spi_mapping[spi->port].gpio_af );
    GPIO_PinAFConfig( spi_mapping[spi->port].pin_mosi->bank,  spi_mapping[spi->port].pin_mosi->number,   spi_mapping[spi->port].gpio_af );
	GPIO_PinAFConfig( gpio_mapping[spi->chip_select].bank,    gpio_mapping[spi->chip_select].number,    GPIO_AF_SPI1 );
#endif

    /* Configure baudrate */
    result = wiced_spi_configure_baudrate( spi->speed, &spi_init.SPI_BaudRatePrescaler );
    if ( result != WICED_SUCCESS )
    {
        return result;
    }

    /* Configure data-width */
    if ( spi->bits == 8 )
    {
        spi_init.SPI_DataSize = SPI_DataSize_8b;
    }
    else if ( spi->bits == 16 )
    {
        if ( spi->mode & SPI_USE_DMA )
        {
            /* 16 bit mode is not supported for a DMA */
            return WICED_ERROR;
        }
        spi_init.SPI_DataSize = SPI_DataSize_16b;
    }
    else
    {
        /* Requested mode is not supported */
        return WICED_BADOPTION;
    }

    /* Configure MSB or LSB */
    if ( spi->mode & SPI_MSB_FIRST )
    {
        spi_init.SPI_FirstBit = SPI_FirstBit_MSB;
    }
    else
    {
        spi_init.SPI_FirstBit = SPI_FirstBit_LSB;
    }

    /* Configure mode CPHA and CPOL */
    if ( spi->mode & SPI_CLOCK_IDLE_HIGH )
    {
        spi_init.SPI_CPOL = SPI_CPOL_High;
    }
    else
    {
        spi_init.SPI_CPOL = SPI_CPOL_Low;
    }

    if ( spi->mode & SPI_CLOCK_RISING_EDGE )
    {
        spi_init.SPI_CPHA = ( spi->mode & SPI_CLOCK_IDLE_HIGH )? SPI_CPHA_2Edge : SPI_CPHA_1Edge;
    }
    else
    {
        spi_init.SPI_CPHA = ( spi->mode & SPI_CLOCK_IDLE_HIGH )? SPI_CPHA_1Edge : SPI_CPHA_2Edge;
    }

    spi_init.SPI_Direction = SPI_Direction_2Lines_FullDuplex;
#ifndef BUILD_WIZFI250 // sekim 20131125 Add SPI Interface
    spi_init.SPI_Mode      = SPI_Mode_Master;
    spi_init.SPI_NSS       = SPI_NSS_Soft;
    SPI_CalculateCRC( spi_mapping[spi->port].spi_regs, DISABLE );

    /* Enable SPI peripheral clock */
    spi_mapping[spi->port].peripheral_clock_func( spi_mapping[spi->port].peripheral_clock_reg,  ENABLE );
#else
    spi_init.SPI_Mode      = SPI_Mode_Slave;
    spi_init.SPI_NSS       = SPI_NSS_Hard;

    SPI_CalculateCRC( spi_mapping[spi->port].spi_regs, DISABLE );

    /* Enable SPI peripheral clock */
    spi_mapping[spi->port].peripheral_clock_func( spi_mapping[spi->port].peripheral_clock_reg,  ENABLE );
{
	NVIC_InitTypeDef  nvic_init_structure;
    nvic_init_structure.NVIC_IRQChannel                   = SPI1_IRQn;
    // sekim XXXXXX
    //nvic_init_structure.NVIC_IRQChannelPreemptionPriority = (uint8_t) 0x5;
    //nvic_init_structure.NVIC_IRQChannelSubPriority        = 0x7;
    nvic_init_structure.NVIC_IRQChannelPreemptionPriority = (uint8_t) 0x0;
    nvic_init_structure.NVIC_IRQChannelSubPriority        = 0x0;
    nvic_init_structure.NVIC_IRQChannelCmd                = ENABLE;
    NVIC_Init( &nvic_init_structure );
}
	SPI_I2S_ITConfig(SPI1, SPI_I2S_IT_TXE, ENABLE);
	// 2013.12.06 sskim
	//SPI_I2S_ITConfig(SPI1, SPI_I2S_IT_RXNE, ENABLE);
	if ( g_spix_bulkmode!=1 ) // sekim XXXXXX
		SPI_I2S_ITConfig(SPI1, SPI_I2S_IT_RXNE, ENABLE);

#endif

