Wiznet-OpenHardware/WizFi250_SDK/WICED-SDK-2.4.0/Wiced/Platform/common/ARM_Cortex_M3/STM32F2xx/stm32f2xx_platform(백업).c
        /* read or write transaction */

        /* some chips( authentication and security related chips ) has to be addressed several times before they acknowledge their address */
        for ( i = 0; i < message->retries; i++ )
        {
            /* generate a start condition */
            I2C_GenerateSTART( i2c_mapping[device->port].i2c, ENABLE );

            /* wait till start condition is generated and the bus becomes free */
            result = i2c_wait_for_event( i2c_mapping[device->port].i2c, I2C_EVENT_MASTER_MODE_SELECT, I2C_FLAG_CHECK_TIMEOUT );
            if ( result != WICED_SUCCESS )
            {
                return WICED_TIMEOUT;
            }

            if ( device->address_width == I2C_ADDRESS_WIDTH_7BIT )
            {
                /* send the address of the requested device, wait for an acknowledge */
                I2C_Send7bitAddress( i2c_mapping[device->port].i2c, (uint8_t) ( device->address << 1 ), ( ( message->tx_buffer ) ? I2C_Direction_Transmitter : I2C_Direction_Receiver ) );

                /* wait till address gets sent and the direction bit is sent */
                if ( message->tx_buffer )
                {
                    result = i2c_wait_for_event( i2c_mapping[device->port].i2c, I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED, I2C_FLAG_CHECK_LONG_TIMEOUT );
                }
                else
                {
                    result = i2c_wait_for_event( i2c_mapping[device->port].i2c, I2C_EVENT_MASTER_RECEIVER_MODE_SELECTED, I2C_FLAG_CHECK_LONG_TIMEOUT );
                }

                if ( result == WICED_SUCCESS )
                {
                    break;
                }
            }
            else
            {
                //TODO
                /* send 10 bits of the address and wait for an acknowledge */
            }
        }
        if ( i == message->retries )
        {
            return WICED_TIMEOUT;
        }

        if ( message->tx_buffer )
        {
            /* write transaction */
            /* configure dma tx channel for i2c */
            i2c_dma_config_and_execute( device, message, WICED_TRUE );

            /* wait till the byte is actually sent from the i2c peripheral */
            counter = 1000;
            while ( I2C_GetFlagStatus( i2c_mapping[device->port].i2c, I2C_FLAG_BTF ) == RESET )
            {
                --counter;
                if ( counter == 0 )
                {
                    return WICED_ERROR;
                }
            }
        }
        else
        {
            /* read transaction */
            if ( message->rx_length == 1 )
            {
                /* disable acknowledgement before we are going to receive a single byte */
                I2C_AcknowledgeConfig( i2c_mapping[device->port].i2c, DISABLE );
            }
            else
            {
                /* enable acknowledgement before we start receiving multiple bytes */
                I2C_AcknowledgeConfig( i2c_mapping[device->port].i2c, ENABLE );
            }

            /* start dma which will read bytes */
            i2c_dma_config_and_execute( device, message, WICED_FALSE );

            /* wait til the last byte is received */
            counter = 1000;
            while ( I2C_GetFlagStatus( i2c_mapping[device->port].i2c, I2C_FLAG_BTF ) == RESET )
            {
                --counter;
                if ( counter == 0 )
                {
                    return WICED_ERROR;
                }
            }
        }
    }

    /* generate a stop condition */
    I2C_GenerateSTOP( i2c_mapping[device->port].i2c, ENABLE );
    return WICED_SUCCESS;
}

static wiced_result_t i2c_transfer_message_no_dma( wiced_i2c_device_t* device, wiced_i2c_message_t* message )
{
    wiced_result_t result;
    int            i = 0;

    if ( message->combined == WICED_TRUE )
    {
        const char* tmp_ptr;
        uint8_t*    tmp_rd_ptr;

        /* combined transaction case, please refer to Philips I2C document to have an understanding of a combined fragment */

        /* some chips( authentication and security related chips ) has to be addressed several times before they acknowledge their address */
        for ( i = 0; i < message->retries; i++ )
        {
            /* generate a start condition and address a device in write mode */
            I2C_GenerateSTART( i2c_mapping[device->port].i2c, ENABLE );

            /* wait till start condition is generated and the bus becomes free */
            result = i2c_wait_for_event( i2c_mapping[device->port].i2c, I2C_EVENT_MASTER_MODE_SELECT, I2C_FLAG_CHECK_TIMEOUT );
            if ( result != WICED_SUCCESS )
            {
                return WICED_TIMEOUT;
            }

            if ( device->address_width == I2C_ADDRESS_WIDTH_7BIT )
            {
                /* send the address and R/W bit set to write of the requested device, wait for an acknowledge */
                I2C_Send7bitAddress( i2c_mapping[device->port].i2c, (uint8_t) ( device->address << 1 ), I2C_Direction_Transmitter );

                /* wait till address gets sent and the direction bit is sent and */
                result = i2c_wait_for_event( i2c_mapping[device->port].i2c, I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED, I2C_FLAG_CHECK_LONG_TIMEOUT );
                if ( result == WICED_SUCCESS )
                {
                    break;
                }
            }
            else
            {
                //TODO
                /* send 10 bits of the address and wait for an acknowledge */
            }
        }

        if ( i == message->retries )
        {
            return WICED_TIMEOUT;
        }

        tmp_ptr = (const char*) message->tx_buffer;

        /* send data to the i2c device */
        for ( i = 0; i < message->tx_length; i++ )
        {
            I2C_SendData( i2c_mapping[device->port].i2c, (uint8_t) tmp_ptr[i] );

            /* wait till it actually gets transferred and acknowledged */
            result = i2c_wait_for_event( i2c_mapping[device->port].i2c, I2C_EVENT_MASTER_BYTE_TRANSMITTED, I2C_FLAG_CHECK_TIMEOUT );
            if ( result != WICED_SUCCESS )
            {
                return result;
            }
        }

