Wiznet-OpenHardware/WizFi250_SDK/WICED-SDK-2.4.0/Wiced/Platform/common/ARM_Cortex_M3/STM32F2xx/stm32f2xx_platform(백업).c
    /* Initialise RX DMA */
    DMA_DeInit( uart_mapping[uart].rx_dma_stream );
    dma_init_structure.DMA_Channel            = uart_mapping[uart].rx_dma_channel;
    dma_init_structure.DMA_PeripheralBaseAddr = (uint32_t) &uart_mapping[uart].usart->DR;
    dma_init_structure.DMA_Memory0BaseAddr    = 0;
    dma_init_structure.DMA_DIR                = DMA_DIR_PeripheralToMemory;
    dma_init_structure.DMA_BufferSize         = 0;
    dma_init_structure.DMA_Mode               = DMA_Mode_Normal;
    DMA_Init( uart_mapping[uart].rx_dma_stream, &dma_init_structure );

    /**************************************************************************
     * Initialise STM32 DMA interrupts
     * Note: Only TX DMA interrupt is enabled.
     **************************************************************************/

    /* Configure TX DMA interrupt on Cortex-M3 */
    nvic_init_structure.NVIC_IRQChannel                   = uart_mapping[uart].tx_dma_irq;
    nvic_init_structure.NVIC_IRQChannelPreemptionPriority = (uint8_t) 0x5;
    nvic_init_structure.NVIC_IRQChannelSubPriority        = 0x8;
    nvic_init_structure.NVIC_IRQChannelCmd                = ENABLE;
    NVIC_Init( &nvic_init_structure );

    /* Enable TC (transfer complete) and TE (transfer error) interrupts on source */
    DMA_ITConfig( uart_mapping[uart].tx_dma_stream, DMA_IT_TC | DMA_IT_TE, ENABLE );

    /* Enable USART's TX and RX DMA interfaces */
    USART_DMACmd( uart_mapping[uart].usart, USART_DMAReq_Rx | USART_DMAReq_Tx, ENABLE );

    /**************************************************************************
     * Initialise STM32 USART interrupt
     **************************************************************************/
    nvic_init_structure.NVIC_IRQChannel                   = uart_mapping[uart].usart_irq;
    nvic_init_structure.NVIC_IRQChannelPreemptionPriority = (uint8_t) 0x6;
    nvic_init_structure.NVIC_IRQChannelSubPriority        = 0x7;
    nvic_init_structure.NVIC_IRQChannelCmd                = ENABLE;

    /* Enable USART interrupt vector in Cortex-M3 */
    NVIC_Init( &nvic_init_structure );

    /* Enable USART */
#ifndef BUILD_WIZFI250//MikeJ 130415 ID1005 - When booting, if there is a lot of USART input, Hang-up occur.
    USART_Cmd( uart_mapping[uart].usart, ENABLE );
#endif

    /* Enable both transmit and receive */
    uart_mapping[uart].usart->CR1 |= USART_CR1_TE;
    uart_mapping[uart].usart->CR1 |= USART_CR1_RE;
#ifdef BUILD_WIZFI250 //MikeJ 130528 ID1072 - Improve UART Performance
	uart_mapping[uart].usart->CR1 |= USART_CR1_OVER8;
#endif

    /* Setup ring buffer */
    if (optional_rx_buffer != NULL)
    {
        /* Note that the ring_buffer should've been initialised first */
        uart_interfaces[uart].rx_buffer = optional_rx_buffer;
        uart_interfaces[uart].rx_size   = 0;
        platform_uart_receive_bytes( uart, optional_rx_buffer->buffer, optional_rx_buffer->size, 0 );
    }
    else
    {
        /* Not using ring buffer. Configure RX DMA interrupt on Cortex-M3 */
        nvic_init_structure.NVIC_IRQChannel                   = uart_mapping[uart].rx_dma_irq;
        nvic_init_structure.NVIC_IRQChannelPreemptionPriority = (uint8_t) 0x5;
        nvic_init_structure.NVIC_IRQChannelSubPriority        = 0x8;
        nvic_init_structure.NVIC_IRQChannelCmd                = ENABLE;
        NVIC_Init( &nvic_init_structure );

        /* Enable TC (transfer complete) and TE (transfer error) interrupts on source */
        DMA_ITConfig( uart_mapping[uart].rx_dma_stream, DMA_IT_TC | DMA_IT_TE, ENABLE );
    }

    MCU_CLOCKS_NOT_NEEDED();

    return WICED_SUCCESS;
}

wiced_result_t wiced_uart_deinit( wiced_uart_t uart )
{
    NVIC_InitTypeDef nvic_init_structure;

    MCU_CLOCKS_NEEDED();

    /* Disable USART */
    USART_Cmd( uart_mapping[uart].usart, DISABLE );

    /* Deinitialise USART */
    USART_DeInit( uart_mapping[uart].usart );

    /**************************************************************************
     * De-initialise STM32 DMA and interrupt
     **************************************************************************/

    /* Deinitialise DMA streams */
    DMA_DeInit( uart_mapping[uart].tx_dma_stream );
    DMA_DeInit( uart_mapping[uart].rx_dma_stream );

    /* Disable TC (transfer complete) interrupt at the source */
    DMA_ITConfig( uart_mapping[uart].tx_dma_stream, DMA_IT_TC | DMA_IT_TE, DISABLE );

    /* Disable transmit DMA interrupt at Cortex-M3 */
    nvic_init_structure.NVIC_IRQChannel                   = uart_mapping[uart].tx_dma_irq;
    nvic_init_structure.NVIC_IRQChannelPreemptionPriority = (uint8_t) 0x5;
    nvic_init_structure.NVIC_IRQChannelSubPriority        = 0x8;
    nvic_init_structure.NVIC_IRQChannelCmd                = DISABLE;
    NVIC_Init( &nvic_init_structure );

    /* Disable DMA peripheral clocks */
    uart_mapping[uart].tx_dma_peripheral_clock_func( uart_mapping[uart].tx_dma_peripheral_clock, DISABLE );
    uart_mapping[uart].rx_dma_peripheral_clock_func( uart_mapping[uart].rx_dma_peripheral_clock, DISABLE );

    /**************************************************************************
     * De-initialise STM32 USART interrupt
     **************************************************************************/

    USART_ITConfig( uart_mapping[uart].usart, USART_IT_RXNE, DISABLE );

    /* Disable UART interrupt vector on Cortex-M3 */
    nvic_init_structure.NVIC_IRQChannel                   = uart_mapping[uart].usart_irq;
    nvic_init_structure.NVIC_IRQChannelPreemptionPriority = (uint8_t) 0xf;
    nvic_init_structure.NVIC_IRQChannelSubPriority        = 0xf;
    nvic_init_structure.NVIC_IRQChannelCmd                = DISABLE;
    NVIC_Init( &nvic_init_structure );

    /* Disable registers clocks */
    uart_mapping[uart].usart_peripheral_clock_func( uart_mapping[uart].usart_peripheral_clock, DISABLE );

    host_rtos_deinit_semaphore(&uart_interfaces[uart].rx_complete);
    host_rtos_deinit_semaphore(&uart_interfaces[uart].tx_complete);

    MCU_CLOCKS_NOT_NEEDED();

    return WICED_SUCCESS;
}

wiced_result_t wiced_uart_transmit_bytes( wiced_uart_t uart, const void* data, uint32_t size )
{
    uint32_t tmpvar; /* needed to ensure ordering of volatile accesses */
    uint32_t shift = uart_mapping[uart].tx_dma_stream_number % 4;

    MCU_CLOCKS_NEEDED();

    uart_mapping[uart].tx_dma_stream->CR &= ~(uint32_t) DMA_SxCR_CIRC;

    if ( uart_mapping[uart].tx_dma_stream_number > 3 )
    {
        tmpvar = uart_mapping[uart].tx_dma->HISR;
        uart_mapping[uart].tx_dma->HIFCR |= ( tmpvar & ( 0xffUL << shift ) );
    }
    else
    {
        tmpvar = uart_mapping[uart].tx_dma->LISR;
        uart_mapping[uart].tx_dma->LIFCR |= ( tmpvar & ( 0xffUL << shift ) );
    }

