Wiznet-OpenHardware/WizFi250_SDK/WICED-SDK-2.4.0/Wiced/Platform/common/ARM_Cortex_M3/STM32F2xx/stm32f2xx_platform(백업).c
void usart2_rx_dma_irq( void )
{
    if ( ( DMA1->HISR & DMA_HISR_TCIF5 ) != 0 )
    {
        DMA1->HIFCR |= DMA_HISR_TCIF5;
        host_rtos_set_semaphore( &uart_interfaces[1].rx_complete, WICED_TRUE );
//        DMA1_Stream5 ->NDTR = uart_interfaces[1].rx_buffer->size;
    }

    /* TX DMA error */
    if ( ( DMA1->HISR & DMA_HISR_TEIF5 ) != 0 )
    {
        /* Clear interrupt */
        DMA1->HIFCR |= DMA_HISR_TEIF5;
    }
}

void usart6_rx_dma_irq( void )
{
    if ( ( DMA2->LISR & DMA_LISR_TCIF1 ) != 0 )
    {
        DMA2->LIFCR |= DMA_LISR_TCIF1;
        host_rtos_set_semaphore( &uart_interfaces[0].rx_complete, WICED_TRUE );
//        DMA1_Stream5 ->NDTR = uart_interfaces[1].rx_buffer->size;
    }

    /* TX DMA error */
    if ( ( DMA2->LISR & DMA_LISR_TEIF1 ) != 0 )
    {
        /* Clear interrupt */
        DMA2->LIFCR |= DMA_LISR_TEIF1;
    }
}

/* STDIO Read/Write functions for Newlib */
void platform_stdio_write( const char* str, uint32_t len )
{
#ifndef WICED_DISABLE_STDIO
    host_rtos_get_semaphore( &stdio_tx_mutex, WICED_NEVER_TIMEOUT, WICED_FALSE );
#ifndef BUILD_WIZFI250 // sekim 20131125 Add SPI Interface
    wiced_uart_transmit_bytes( STDIO_UART, (void*)str, len );
#else
    // sekim 20131125 Add SPI Interface ==>
	if ( platfrom_spi_stdio==0 || platfrom_spi_stdio==1 )
	{
		wiced_uart_transmit_bytes( STDIO_UART, (void*)str, len );
	}
	if ( platfrom_spi_stdio==0 || platfrom_spi_stdio==2 )
	{
		uint32_t freelen;
		freelen = ring_buffer_free_space(&stdio_tx_buffer);

		while(freelen < len) {
			freelen = ring_buffer_free_space(&stdio_tx_buffer);
			host_rtos_delay_milliseconds(1);
		}

		ring_buffer_write(&stdio_tx_buffer, (uint8_t*)str, len);

		if(spi_tx_sig_cnt <= 0) {
			spi_tx_sig_cnt = SPI_GPIO_CLEAR_COUNT;
			if(spi_rx_stop == WICED_FALSE) wiced_gpio_output_high( WIZFI_SPI_REQ );
		}
	}

#endif
    host_rtos_set_semaphore( &stdio_tx_mutex, WICED_FALSE );
#else
    UNUSED_PARAMETER( str );
    UNUSED_PARAMETER( len );
#endif
}

void platform_stdio_read( char* str, uint32_t len )
{
#ifndef WICED_DISABLE_STDIO
    host_rtos_get_semaphore( &stdio_rx_mutex, WICED_NEVER_TIMEOUT, WICED_FALSE );
    wiced_uart_receive_bytes( STDIO_UART, (void*)str, len, WICED_NEVER_TIMEOUT );
    host_rtos_set_semaphore( &stdio_rx_mutex, WICED_FALSE );
#else
    UNUSED_PARAMETER( str );
    UNUSED_PARAMETER( len );
#endif
}

#define RTC_INTERRUPT_EXTI_LINE EXTI_Line22
#define WUT_COUNTER_MAX  0xffff

#define ENABLE_INTERRUPTS   __asm("CPSIE i")
#define DISABLE_INTERRUPTS  __asm("CPSID i")

#if defined(WICED_DISABLE_MCU_POWERSAVE) && defined(WICED_ENABLE_MCU_RTC)
/*  */
void platform_rtc_init(void)
{
    RTC_InitTypeDef RTC_InitStruct;

    RTC_DeInit( );

    RTC_InitStruct.RTC_HourFormat = RTC_HourFormat_24;

    /* RTC ticks every second */
    RTC_InitStruct.RTC_AsynchPrediv = 0x7F;
    RTC_InitStruct.RTC_SynchPrediv = 0xFF;

    RTC_Init( &RTC_InitStruct );
    /* Enable the LSE OSC */
    RCC_LSEConfig(RCC_LSE_ON);
    /* Wait till LSE is ready */
    while(RCC_GetFlagStatus(RCC_FLAG_LSERDY) == RESET)
    {
    }
    /* Select the RTC Clock Source */
    RCC_RTCCLKConfig(RCC_RTCCLKSource_LSE);

    /* Enable the RTC Clock */
    RCC_RTCCLKCmd(ENABLE);

    /* RTC configuration -------------------------------------------------------*/
    /* Wait for RTC APB registers synchronisation */
    RTC_WaitForSynchro();

    /* write default application time inside rtc */
    platform_set_rtc_time(&wiced_default_time);
}
#endif

/**
 * This function will return the value of time read from the on board CPU real time clock. Time value must be given in the format of
 * the structure wiced_rtc_time_t
 *
 * @return    WICED_SUCCESS : on success.
 * @return    WICED_ERROR   : if an error occurred with any step
 */
wiced_result_t wiced_platform_get_rtc_time(wiced_rtc_time_t* time)
{
#ifdef WICED_ENABLE_MCU_RTC
    RTC_TimeTypeDef rtc_read_time;
    RTC_DateTypeDef rtc_read_date;

    if( time == 0 )
    {
        return WICED_BADARG;
    }

    /* save current rtc time */
    RTC_GetTime( RTC_Format_BIN, &rtc_read_time );
    RTC_GetDate( RTC_Format_BIN, &rtc_read_date );

    /* fill structure */
    time->sec = rtc_read_time.RTC_Seconds;
    time->min = rtc_read_time.RTC_Minutes;
    time->hr = rtc_read_time.RTC_Hours;
    time->weekday = rtc_read_date.RTC_WeekDay;
    time->date = rtc_read_date.RTC_Date;
    time->month= rtc_read_date.RTC_Month;
    time->year = rtc_read_date.RTC_Year;

    return WICED_SUCCESS;
#else /* #ifdef WICED_ENABLE_MCU_RTC */
    UNUSED_PARAMETER(time);
    return WICED_UNSUPPORTED;
#endif /* #ifdef WICED_ENABLE_MCU_RTC */
}

/**
 * This function will set MCU RTC time to a new value. Time value must be given in the format of
 * the structure wiced_rtc_time_t
 *
 * @return    WICED_SUCCESS : on success.
 * @return    WICED_ERROR   : if an error occurred with any step
 */
wiced_result_t wiced_platform_set_rtc_time(wiced_rtc_time_t* time)
{
#ifdef WICED_ENABLE_MCU_RTC
    RTC_TimeTypeDef rtc_write_time;
    RTC_DateTypeDef rtc_write_date;
    wiced_bool_t    valid = WICED_FALSE;

    WICED_VERIFY_TIME(time, valid);
    if( valid == WICED_FALSE )
    {
        return WICED_BADARG;
    }
    rtc_write_time.RTC_Seconds = time->sec;
    rtc_write_time.RTC_Minutes = time->min;
    rtc_write_time.RTC_Hours   = time->hr;
    rtc_write_date.RTC_WeekDay = time->weekday;
    rtc_write_date.RTC_Date    = time->date;
    rtc_write_date.RTC_Month   = time->month;
    rtc_write_date.RTC_Year    = time->year;


    RTC_SetTime( RTC_Format_BIN, &rtc_write_time );
    RTC_SetDate( RTC_Format_BIN, &rtc_write_date );

    return WICED_SUCCESS;
#else /* #ifdef WICED_ENABLE_MCU_RTC */
    UNUSED_PARAMETER(time);
    return WICED_UNSUPPORTED;
#endif /* #ifdef WICED_ENABLE_MCU_RTC */
}

#ifndef WICED_DISABLE_MCU_POWERSAVE

static int stm32f2_clock_needed_counter = 0;

void stm32f2xx_clocks_needed( void )
{
    DISABLE_INTERRUPTS;
    if ( stm32f2_clock_needed_counter <= 0 )
    {
        SCB->SCR &= (~((unsigned long)SCB_SCR_SLEEPDEEP_Msk));
        stm32f2_clock_needed_counter = 0;
    }
    stm32f2_clock_needed_counter++;
    ENABLE_INTERRUPTS;
}

void stm32f2xx_clocks_not_needed( void )
{
    DISABLE_INTERRUPTS;
    stm32f2_clock_needed_counter--;
    if ( stm32f2_clock_needed_counter <= 0 )
    {
        SCB->SCR |= SCB_SCR_SLEEPDEEP_Msk;
        stm32f2_clock_needed_counter = 0;
    }
    ENABLE_INTERRUPTS;
}


#ifndef WICED_DISABLE_MCU_POWERSAVE
void RTC_Wakeup_init(void)
{
    NVIC_InitTypeDef NVIC_InitStructure;
    EXTI_InitTypeDef EXTI_InitStructure;
    RTC_InitTypeDef RTC_InitStruct;

    RTC_DeInit( );

    RTC_InitStruct.RTC_HourFormat = RTC_HourFormat_24;

    /* RTC ticks every second */
    RTC_InitStruct.RTC_AsynchPrediv = 0x7F;
    RTC_InitStruct.RTC_SynchPrediv = 0xFF;

    RTC_Init( &RTC_InitStruct );

